In [1]:
import pandas as pd

In [2]:
# import nltk
# from nltk.corpus import words

# nltk.download("words")
# words_list = words.words()

In [3]:
# lis = words_list

In [4]:
# df = pd.DataFrame(lis, columns=['words'])
# df.to_csv('wordlist.csv')

In [5]:
# wordlist = pd.read_csv('wordlist.csv')

In [6]:
# df['char'] = df['words'].apply(len)

In [7]:
# def calculate_sum(word):
    # return sum(ord(char.lower()) - ord('a') + 1 for char in word)

In [8]:
# df['value'] = df['words'].apply(calculate_sum)

In [9]:
# df.to_csv('wordlist.csv')

In [10]:
import pandas as pd
df = pd.read_csv('wordlist.csv')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 236736 entries, 0 to 236735
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   words   236734 non-null  object
 1   char    236736 non-null  int64
 2   value   236736 non-null  int64
dtypes: int64(2), object(1)
memory usage: 5.4+ MB

In [12]:
df.head()

   words  char  value
0      A     1      1
1      a     1      1
2     aa     2      2
3    aal     3     14
4  aalii     5     32

In [13]:
# df.drop(columns=['Unnamed: 0'])

In [14]:
df = df.set_index('words')

In [15]:
df

           char  value
words
A             1      1
a             1      1
aa            2      2
aal           3     14
aalii         5     32
...         ...    ...
yellow        6     92
yes           3     49
yesterday     9    122
you           3     61
young         5     82

[236736 rows x 2 columns]

In [16]:
df.loc['hi']

char      2
value    17
Name: hi, dtype: int64

In [17]:
df.loc['hi', 'value']

17

In [18]:
df['value'].max()

328

In [19]:
df.max()

char      24
value    328
dtype: int64

In [20]:
# df.drop(columns=['Unnamed: 0'], inplace=True)
# df.describe()

In [21]:
df.loc[["A"
    ,"a"
    ,"aa"
    ,"aal"
    ,"aalii"
], ]

       char  value
words
A         1      1
a         1      1
a         1      1
aa        2      2
aal       3     14
aalii     5     32

In [22]:
df.loc[["A"
    ,"a"
    ,"aa"
    ,"aal"
    ,"aalii"
], "value"]

words
A         1
a         1
a         1
aa        2
aal      14
aalii    32
Name: value, dtype: int64

In [23]:
df.describe()

                char          value
count  236736.000000  236736.000000
mean        9.553574     112.206137
std         2.935577      40.960059
min         1.000000       1.000000
25%         7.000000      83.000000
50%         9.000000     109.000000
75%        11.000000     139.000000
max        24.000000     328.000000

In [24]:
df.sort_values(by=['value'], ascending=False)

                          char  value
words
dacryocystosyringotomy      22    328
thyroparathyroidectomize    24    317
ureterocystanastomosis      22    314
pyopneumocholecystitis      22    307
laparocolpohysterotomy      22    307
...                        ...    ...
b                            1      2
aa                           2      2
a                            1      1
a                            1      1
A                            1      1

[236736 rows x 2 columns]

In [25]:
(df['value'] == 123)

words
A            False
a            False
aa           False
aal          False
aalii        False
             ...
yellow       False
yes          False
yesterday    False
you          False
young        False
Name: value, Length: 236736, dtype: bool

In [26]:
df['value'].mode()

0    102
Name: value, dtype: int64

In [27]:
df['value'].value_counts().head(10)

value
102    2365
107    2334
97     2333
100    2306
98     2282
115    2278
101    2277
108    2269
110    2265
104    2263
Name: count, dtype: int64

In [28]:
df.loc[df['value']==100].head()

             char  value
words
abactinally    11    100
abrogative     10    100
absinthol       9    100
acclimation    11    100
accumulate     10    100

In [34]:
df.loc[
    (df['value'] == 100) &
    (df['char'] == df.loc[df['value'] == 100, 'char'].min())
]

       char  value
words
buzzy     5    100
nutty     5    100
pussy     5    100
struv     5    100
totty     5    100
tousy     5    100

In [35]:
df.head()

       char  value
words
A         1      1
a         1      1
aa        2      2
aal       3     14
aalii     5     32

In [38]:
df['Ratio'] = df['value'] / df['char']
df

           char  value      Ratio
words
A             1      1   1.000000
a             1      1   1.000000
aa            2      2   1.000000
aal           3     14   4.666667
aalii         5     32   6.400000
...         ...    ...        ...
yellow        6     92  15.333333
yes           3     49  16.333333
yesterday     9    122  13.555556
you           3     61  20.333333
young         5     82  16.400000

[236736 rows x 3 columns]

In [41]:
df.describe()

                char          value          Ratio
count  236736.000000  236736.000000  236736.000000
mean        9.553574     112.206137      11.700524
std         2.935577      40.960059       2.230954
min         1.000000       1.000000       1.000000
25%         7.000000      83.000000      10.272727
50%         9.000000     109.000000      11.750000
75%        11.000000     139.000000      13.166667
max        24.000000     328.000000      26.000000

In [40]:
df['Ratio'].max()

26.0

In [42]:
df.sort_values(by='Ratio', ascending=False).head()

       char  value  Ratio
words
Z         1     26   26.0
z         1     26   26.0
Y         1     25   25.0
y         1     25   25.0
wuzzy     5    121   24.2

In [43]:
df.loc[df['Ratio'] == df['Ratio'].max()]

       char  value  Ratio
words
Z         1     26   26.0
z         1     26   26.0

In [44]:
df['Ratio'].value_counts()

Ratio
12.000000    4736
11.000000    4521
13.000000    4139
10.000000    3434
14.000000    2776
             ...
17.818182       1
12.476190       1
7.882353        1
22.200000       1
21.285714       1
Name: count, Length: 1483, dtype: int64

In [47]:
df.loc[df['Ratio'] == 10].shape

(3434, 3)

In [48]:
df.query("Ratio == 10").shape

(3434, 3)

In [55]:
df.loc[df['Ratio'] == 10].sort_values(by="value", ascending=False).head(2)

                       char  value  Ratio
words
pathologicoanatomical    21    210   10.0
anatomicopathological    21    210   10.0

In [53]:
df.loc[df['Ratio'] == 10, 'value'].max()

210

In [58]:
df.query("value == 260").sort_values(by='char')

                        char  value      Ratio
words
gastrohysteropexy         17    260  15.294118
overobsequiousness        18    260  14.444444
psychophysiologist        18    260  14.444444
extraconstitutional       19    260  13.684211
Hypsiprymnodontinae       19    260  13.684211
hexosemonophosphoric      20    260  13.000000
scleroconjunctivitis      20    260  13.000000
chromophotolithograph     21    260  12.380952
philosophicoreligious     21    260  12.380952
photochromolithograph     21    260  12.380952
dacryocystoblennorrhea    22    260  11.818182
electrotelethermometer    22    260  11.818182

In [59]:
df['value'].describe()

count    236736.000000
mean        112.206137
std          40.960059
min           1.000000
25%          83.000000
50%         109.000000
75%         139.000000
max         328.000000
Name: value, dtype: float64

In [61]:
mean_char_count = df['char'].mean()

In [64]:
df.query("`char` > 12")

                  char  value      Ratio
words
abarticulation      14    146  10.428571
abdominoanterior    16    173  10.812500
abdominocardiac     15    112   7.466667
abdominocentesis    16    167  10.437500
abdominocystic      14    152  10.857143
...                ...    ...        ...
zygosporophore      14    218  15.571429
zymophosphate       13    187  14.384615
zymotechnical       13    154  11.846154
advertisement       13    155  11.923077
representative      14    177  12.642857

[37434 rows x 3 columns]

In [67]:
df.query("`char` > @mean_char_count")

                char  value      Ratio
words
abacination       11     89   8.090909
abactinally       11    100   9.090909
abalienate        10     70   7.000000
abalienation      12    103   8.583333
abandonable       11     71   6.454545
...              ...    ...        ...
organization      12    149  12.416667
punishment        10    139  13.900000
representative    14    177  12.642857
responsible       11    134  12.181818
suggestion        10    136  13.600000

[114804 rows x 3 columns]